// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
//
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
//
// let array = [];
//
// array[1] = 1;
// array[0] = 22;
// array[2] = 33;
//
// console.log(array);

//
//
// - є масив [2,17,13,6,22,31,45,66,100,-18] :

// let arr = [2,17,13,6,22,31,45,66,100,-18];

// 1. перебрати його циклом while
//
// let i = 0;
// while (i < arr.length) {
//     let arrEl = arr[i];
//     console.log(arrEl);
//     i++;
// }

// 2. перебрати його циклом for

// for (let i=0; i<arr.length; i++) {
//     let arrEl = arr[i];
//     console.log(arrEl);
// }

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

// i = 0;
// while (i < arr.length) {
//     if (i%2 !== 0){
//         console.log('index', i, '=', arr[i]);
//        }
//     i++
// }

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

// for (i = 0; i < arr.length; i++) {
//     if (i%2 !== 0){
//         console.log('index', i, '=', arr[i]);
//        }
// }

// 5. перебрати циклом while та вивести  числа тільки парні  значення

// i = 0;
// while ( i < arr.length){
//     if (i%2 === 0) {
//         console.log('index', i, '=', arr[i]);
//     }
//     i++;
// }

// 6. перебрати циклом for та вивести  числа тільки парні  значення
//
// for (i = 0; i < arr.length; i++) {
//     if (i % 2 === 0) {
//         console.log(i, arr[i])
//     }
// }

// 7. замінити кожне число кратне 3 на слово "okten"

// i = 0;
// while ( i < arr.length) {
//     if (arr[i]%3 === 0) {
//         arr[i] = 'okten';
//     }
//     i++
// }
// console.log(arr);

// 8. вивести масив в зворотньому порядку.
//


// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

// let arr = [2,17,13,6,22,31,45,66,100,-18];
//
// for (let i = arr.length; i >= 0; i--) {
//     const arrElement = arr[i];
//     console.log(i, arrElement);
//
// }

// - Створити масив з 10 стрікрових елементів. Вивести в консоль всі його елементи в циклі.

// let arr = ['1aa', '2bb', '3cc', '4tt'];
//
// for (let i = arr.length; i >= 0; i--) {
//     arrEl = arr[i];
//     console.log(arrEl);
// }


// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

// let data = [11, 'rr', true, false, NaN, 0, 'ee'];
//
// for (i = 0; i < data.length; i++) {
//     if (typeof data[i] === "boolean") {
//         console.log( data[i]);
//     }
// }

// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор