// Всі функції повинні бути описані стрілочним типом!!!!

// 1 - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
// let foo = (a, b, c) => {
//     if (a < b && a < c) {
//         return a;
//     } else if (b < a && b < c) {
//         return b;
//     } else if (c < a && c < b) {
//         return c;
//     }
// }
//
// console.log(foo(1, 2, 3));

// 2 - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
// let maxNum = (a, b, c) => {
//     if (a > b && a > c) {
//         return a;
//     } else if (b > a && b > c) {
//         return b;
//     } else {
//         return c;
//     }
// };
//
// console.log(maxNum(-1, -110, 1));

// 3 - створити функцію яка повертає найбільше число з масиву
// let maxNumArr = (array) => {
//     let first = array[0];
//     for (const arrEl of array) {
//         if (arrEl > first) {
//             first = arrEl;
//         }
//     }
//     return first;
// }
//
// console.log(maxNumArr([1, 2, 3]));

// 4 - створити функцію яка повертає найменьше число з масиву
// let minNumArr = (array) => {
//     let min = array[0];
//     for (const arrEl of array) {
//         if (arrEl < min) {
//             min = arrEl;
//         }
//     }
//     return min;
// };
//
// console.log(minNumArr([1, 2, 3]));

// 5 - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
//
// let sum = (array) => {
//     let sum = 0;
//     for (const arrEl of array) {
//         sum = arrEl + sum;
//     }
//     return sum;
// }
//
// console.log(sum([1,2,3]));

// 6 - Дано натуральное число n. Выведите все числа от 1 до n.
//
// let foo = (z) => {
//     for (let i = 0; i < z ; i++) {
//         console.log(1 + i);
//     }
// };
// foo(15);

// 7 - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
//
// let foo = (a, b) => {
//         if (a < b) {
//             for (let i = 0; i < b ; i++) {
//                 console.log(a + i)
//             }
//         } else if (a > b) {
//             for (let i = a - 1; i >= 0; i--) {
//                 console.log(b + i);
//             }
//         }
// };
//
// foo(1, 5);
// foo(5, 1);

// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//
// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]